from collections import deque

balanced_parentheses_string = "()))((()"

# 1단계 입력이 빈 문자일 경우 빈 문자열 리턴
# 2단계 문자열 w를 두 균형잡힌 문자열, u,v으로 분리 단 u는 균형잡힌 문자열로 더 이상 분리할 수 없음, v는 빈 문자열 가능
def get_correct_parentheses(balanced_parentheses_string):
    # 빈 문자열이면 빈문자열 반환
    # w = )()()()(
    # 1. w = )()()()(이 빈 문자열 인가 ? -> 아님
    # 2. )()()()(를 균형잡힌 문자열로 u,v 분리 u = )( v=  )()()(
        # u가 올바른문자열이 아니기 때문에 빈문자열에 ( 붙임
        # 문자열 v= )()()(에 대해 1단계부터 수행
            # 1. )()()(이 빈 문자열 인가 ? -> 아님
            # 2. )()()( 를 균형잡힌 문자열로 u,v 분리  u = )( v= )()(
              # u가 올바른 문자열이 아니기 때문에 빈 문자열에 ( 붙임
              # 문자열 v =  )()( 에 대해 1단계부터 수행
                # 1. v =  )()( 이 빈 문자열인가? -> 아님
                # 2. )()( 를 균형잡힌 문자열로 u,v 분리 u = )(, v= )(
                  # u가 올바른 문자열이 아니기 때문에 빈 문자열에 ( 붙임 str = "("
                  # 문자열 v = )( 에 대해 1단계부터 수행
                    # 1. v = )( 이 빈 문자열인가? -> 아님
                    # 2. )( 를 균형잡힌 문자열로 u,v 분리 u = )(,  v= ""
                        # u가 올바른 문자열이 아니기 때문에 빈 문자열에 ( 붙임 str = "("
                        # 문자열 v= "" 에 대해 1단계부터 수행
                        # 빈 문자열이라서 빈 문자열 반환 -> str = "("
                    # 3. )를 다시 붙임 str = ()
                    # 4. u에서 첫번째 마지막 문자 제거 u = )( 를 제거 하면 u = ""
                    # 5. 생성된 문자열 반환 ()
                 # str에 v에 대해 1단계 수행했던 문자열 붙임 (()
                # 3. )를 다시 붙임 (())
                # 4. u에서 첫번째/마지막 문자 제거  u = )( 를 제거 하면 u = ""
                # 5. 생성된 문자열 반환(())
              # str에 v에 대해 1단계 수행했던 문자열 붙임 ((())
            # 3. ) 를 다시 붙임 ((()))
            # 4. u에서 첫번째/마지막 문자 제거  u = )( 를 제거 하면 u = ""
            # 5. 생성된 문자열 반환 ((()))
        # str에 v에 대해 1단계 수행했던 문자열 붙임 (((()))
    # 3.) 를 다시 붙임 (((())))
    # 4. u에서 첫번째/마지막 문자 제거  u = )( 를 제거 하면 u = ""
    # 5. 생성된 문자열 반환 (((())))



    return


print(get_correct_parentheses(balanced_parentheses_string))  # "()(())()"가 반환 되어야 합니다!

print("정답 = (((()))) / 현재 풀이 값 = ", get_correct_parentheses(")()()()("))
print("정답 = ()()( / 현재 풀이 값 = ", get_correct_parentheses("))()("))
print("정답 = ((((()())))) / 현재 풀이 값 = ", get_correct_parentheses(')()()()(())('))